<a href="https://colab.research.google.com/github/Terrykamau/Python/blob/main/data_analysis_lesson_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
import numpy as np

In [9]:
data={'name': ['teresiah','Njoki','kamau','wambui','Mary'],
      'country':['kenya','uganda',1,'djibouti',np.nan],
      'age':[20,30,40,np.nan,60]}
df=pd.DataFrame(data)
print(df)

       name   country   age
0  teresiah     kenya  20.0
1     Njoki    uganda  30.0
2     kamau         1  40.0
3    wambui  djibouti   NaN
4      Mary       NaN  60.0

In [27]:
df['age'].ffill()

0    20.0
1    30.0
2    40.0
3    40.0
4    60.0
Name: age, dtype: float64

In [29]:
df.dtypes

name        object
country     object
age        float64
Range       object
Z_score     object
dtype: object

In [30]:
df['country'].apply(type).value_counts()

country
<class 'str'>      3
<class 'int'>      1
<class 'float'>    1
Name: count, dtype: int64

In [31]:
df['Range']=df['age'].apply(lambda age:'x'if age<25 else "")

In [36]:
df['Z_score']=df['age']-df['age'].mean()/df['age'].std()

In [37]:
df['Z_score']=df['Z_score'].apply(lambda value:"x" if value <-2 or value > 2 else "")

In [40]:
q1=df['age'].quantile(q=0.25)
q3=df['age'].quantile(q=0.75)
iqr=q3-q1
print(iqr)

17.5

In [41]:
lower_bound= q1-1.5*iqr
print(lower_bound)

1.25

In [42]:
upper_bound=q3+1.5*iqr
print(upper_bound)

71.25

In [44]:
df['iqr']=df['age'].apply(lambda age:'x' if age<lower_bound or age>upper_bound else " ")
print(df)

       name   country   age Range Z_score iqr
0  teresiah     kenya  20.0     x       x
1     Njoki    uganda  30.0             x
2     kamau         1  40.0             x
3    wambui  djibouti   NaN
4      Mary       NaN  60.0             x

In [45]:
from sklearn.ensemble import IsolationForest as IS

In [46]:
model=IS(contamination='auto')

In [48]:
df['IsolationForest']=model.fit_predict(df[['age']])
print(df)

       name   country   age Range Z_score iqr  IsolationForest
0  teresiah     kenya  20.0     x       x                   -1
1     Njoki    uganda  30.0             x                    1
2     kamau         1  40.0             x                    1
3    wambui  djibouti   NaN                                  1
4      Mary       NaN  60.0             x                    1

In [49]:
df.query("age>=10 and age>=60") #deleting the value

   name country   age Range Z_score iqr  IsolationForest
4  Mary     NaN  60.0             x                    1

In [50]:
df['age'].apply(lambda x:min(x,65)) #correcting the value

0    20.0
1    30.0
2    40.0
3     NaN
4    60.0
Name: age, dtype: float64